{
    "basic_info": {
      "description_header": "Hello!",
      "description": "My name is Josh. I’m a full stack software engineer specializing in Javascript. I am a military veteran  with a decade of experience in aerospace, and currently work in administration management. I decided to make a change to get into software due to the lifestyle flexibility, unlimited creative potential and having a satisfying career that is challenging and rewarding. Software is an exciting industry to me because of the powerful impact it has on everyday life in every corner of the world. I thrive in an environment where personal and professional growth is mandatory and exceptional teamwork is a must. I believe that my experience as a mechanic could benefit me with troubleshooting and diagnosing software issues as well as not being too flustered if something is not working in a timely manner.  I feel a deep satisfaction when I fix something and will to bring that passion and drive to the workplace.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Nomad",
        "startDate": "December 2023",
        "description": "Nomad, an innovative web-based app, envisions simplifying travel planning with features that enable users to map out routes, explore local camping and Airbnb options, and conveniently save their itinerary by signing in. Beyond its practical functionality, Nomad fosters a vibrant community with an interactive travel blogging section, encouraging users to share their adventures and insights. With its comprehensive approach, Nomad emerges as an all-in-one road trip companion, empowering individuals to effortlessly organize and enhance their vacation experiences. I was responsible for getting the blog page and google map page functional, designed, and integrated",
        "images": [
          "images/portfolio/nomad/explore.png",
          "images/portfolio/nomad/map.png",
          "images/portfolio/nomad/trails.png",
          "images/portfolio/nomad/blog.png"
          
                ],
        "url": "https://github.com/tech-enigmas/my-app",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React-Native"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "TypeScript"
          },  
          {
            "class": "devicon-nodejs-plain",
            "name": "NodeJS"
          },
          {
            "class": "devicon-mongodb-plain",
            "name": "MongoDB"
          }
        ]
      },
      {
        "title": "Travellers Quill",
        "startDate": "September 2023",
        "description": "A backend blog platform using Express that implements Inquirer library for NodeJS wherein blog posts will be created using full CRUD functionality and is stored in MongoDB. Users may search by author or title and like/comment on blogs.",
        "images": [
          "images/portfolio/travelersQuill/tq1.png",
          "images/portfolio/travelersQuill/tq2.png",
          "images/portfolio/travelersQuill/tq3.png",
          "images/portfolio/travelersQuill/tq4.png",
          "images/portfolio/travelersQuill/tq5.png"
        ],
        "url": "https://github.com/tech-enigmas/travelers-quill",
        "technologies": [
          {
            "class": "devicon-nodejs-plain",
            "name": "NodeJS"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-mongodb-plain",
            "name": "MongoDB"
          }
        ]
      },
      {
        "title": "Calendar App",
        "startDate": "March 2023",
        "description": "Collaborating with fantastic classmates, we embarked on our inaugural group project—an innovative calendar app designed to streamline daily life planning. Packed with versatile organizational features, our calendar ensures functionality and interactivity. Seamlessly input appointments or events, utilize the integrated to-do list, and effortlessly keep track of tasks for an enhanced and practical scheduling experience.",
        "images": [
          "images/portfolio/calendar/p1.jpg"
         
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
         
        ]
      }
    ],
    "experience": [
      {
        "company": "CodeFellows Student",
        "title": "Advanced Fullstack JavaScript Developer",
        "years": "1.2023 - present",
        "mainTech": [
          "JavaScript"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "Redux",
          "Swagger",
          "Socket.IO"
        ]
      },
      {
        "company": "Marine Engineers Beneficial Association",
        "title": "Office Manager",
        "years": "12.2020 - present",
        "mainTech": [
          "MOS"
        ],
        "technologies": [
          
        ]
      }
    ]
  }
